In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

Finding unique values on a DataFrame

In [3]:
df['col2'].unique()

array([444, 555, 666])

Count of unique values in a column

In [6]:
df['col2'].nunique()

3

Table of unique values counts

In [9]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

**Selecting Data Review**

In [12]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [13]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

**Apply Method (Similar to .map)**

In [15]:
def double(x):
    return x*2

In [16]:
df['col1'].apply(double)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

Apply built in functions

In [19]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

Apply combined with lambda expressions

In [20]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

Drop columns

use `inplace=true` to mutate the original Data Frame

In [22]:
df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

Column an index names

In [23]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [24]:
df.index

RangeIndex(start=0, stop=4, step=1)

**Sorting and ordering**

In [26]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

**Null values**

In [27]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

**Pivot Table**

Very common in Excel

In [35]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [36]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [37]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN